{
  "last_updated": "2025-12-10T09:41:00.646919",
  "system_status": "idle",
  "portfolio": {
    "holdings": [
      {
        "ticker": "AML",
        "symbol": "AML.L",
        "shares": 219.11553189,
        "baseline_value_gbp": 135.7,
        "current_value_gbp": 139.686151579875,
        "change_gbp": 3.9861515798750133,
        "change_pct": 2.937473529753142,
        "action": "HOLD",
        "action_reason": "",
        "risk_bucket": "low-beta-uk",
        "analysis_summary": "AML (AML.L) is currently valued at £139.69 against a baseline of £135.70, giving a mark-to-market change of +£3.99 (+2.94%). It sits in the 'low-beta-uk' risk bucket, which reflects how much volatility and drawdown we are prepared to tolerate for this position. The current rule-based action is **HOLD**, with the position remaining inside the normal tolerance band for now. From a macro perspective, the broader market backdrop is interpreted through indicators such as VIX, credit spreads and key index levels. Signals are mostly neutral with no strong positives or negatives. Sector-level signals capture whether the immediate ecosystem around AML is trending risk-on or risk-off relative to the wider market. Signals are mostly neutral with no strong positives or negatives. At the stock level, the engine folds together insider activity, options flows and other micro signals into a single risk-adjusted tilt. Signals are mostly neutral with no strong positives or negatives. Taken together, this keeps the emphasis on medium to high risk and high potential reward, while staying anchored to explicit rules rather than intuition. The summary should be read as a snapshot, updated each time a fresh evaluation is run rather than a standing recommendation. "
      },
      {
        "ticker": "NVDA",
        "symbol": "NVDA",
        "shares": 0.92807971,
        "baseline_value_gbp": 131.73,
        "current_value_gbp": 128.95274015708225,
        "change_gbp": -2.7772598429177435,
        "change_pct": -2.108297155482991,
        "action": "HOLD",
        "action_reason": "",
        "risk_bucket": "core-ai",
        "analysis_summary": "NVDA (NVDA) is currently valued at £128.95 against a baseline of £131.73, giving a mark-to-market change of £-2.78 (-2.11%). It sits in the 'core-ai' risk bucket, which reflects how much volatility and drawdown we are prepared to tolerate for this position. The current rule-based action is **HOLD**, with the position remaining inside the normal tolerance band for now. From a macro perspective, the broader market backdrop is interpreted through indicators such as VIX, credit spreads and key index levels. Signals are mostly neutral with no strong positives or negatives. Sector-level signals capture whether the immediate ecosystem around NVDA is trending risk-on or risk-off relative to the wider market. Signals are mostly neutral with no strong positives or negatives. At the stock level, the engine folds together insider activity, options flows and other micro signals into a single risk-adjusted tilt. Signals are mostly neutral with no strong positives or negatives. Taken together, this keeps the emphasis on medium to high risk and high potential reward, while staying anchored to explicit rules rather than intuition. The summary should be read as a snapshot, updated each time a fresh evaluation is run rather than a standing recommendation. "
      },
      {
        "ticker": "ARM",
        "symbol": "ARM",
        "shares": 0.44778043,
        "baseline_value_gbp": 54.03,
        "current_value_gbp": 47.740098662907165,
        "change_gbp": -6.289901337092836,
        "change_pct": -11.641497940205138,
        "action": "HOLD",
        "action_reason": "",
        "risk_bucket": "core-ai",
        "analysis_summary": "ARM (ARM) is currently valued at £47.74 against a baseline of £54.03, giving a mark-to-market change of £-6.29 (-11.64%). It sits in the 'core-ai' risk bucket, which reflects how much volatility and drawdown we are prepared to tolerate for this position. The current rule-based action is **HOLD**, with the position remaining inside the normal tolerance band for now. From a macro perspective, the broader market backdrop is interpreted through indicators such as VIX, credit spreads and key index levels. Signals are mostly neutral with no strong positives or negatives. Sector-level signals capture whether the immediate ecosystem around ARM is trending risk-on or risk-off relative to the wider market. Signals are mostly neutral with no strong positives or negatives. At the stock level, the engine folds together insider activity, options flows and other micro signals into a single risk-adjusted tilt. Signals are mostly neutral with no strong positives or negatives. Taken together, this keeps the emphasis on medium to high risk and high potential reward, while staying anchored to explicit rules rather than intuition. The summary should be read as a snapshot, updated each time a fresh evaluation is run rather than a standing recommendation. "
      },
      {
        "ticker": "AVGO",
        "symbol": "AVGO",
        "shares": 0.15967921,
        "baseline_value_gbp": 40.27,
        "current_value_gbp": 48.733601632960095,
        "change_gbp": 8.463601632960092,
        "change_pct": 21.017138398212296,
        "action": "HOLD",
        "action_reason": "",
        "risk_bucket": "core-ai",
        "analysis_summary": "AVGO (AVGO) is currently valued at £48.73 against a baseline of £40.27, giving a mark-to-market change of +£8.46 (+21.02%). It sits in the 'core-ai' risk bucket, which reflects how much volatility and drawdown we are prepared to tolerate for this position. The current rule-based action is **HOLD**, with the position remaining inside the normal tolerance band for now. From a macro perspective, the broader market backdrop is interpreted through indicators such as VIX, credit spreads and key index levels. Signals are mostly neutral with no strong positives or negatives. Sector-level signals capture whether the immediate ecosystem around AVGO is trending risk-on or risk-off relative to the wider market. Signals are mostly neutral with no strong positives or negatives. At the stock level, the engine folds together insider activity, options flows and other micro signals into a single risk-adjusted tilt. Signals are mostly neutral with no strong positives or negatives. Taken together, this keeps the emphasis on medium to high risk and high potential reward, while staying anchored to explicit rules rather than intuition. The summary should be read as a snapshot, updated each time a fresh evaluation is run rather than a standing recommendation. "
      },
      {
        "ticker": "AMZN",
        "symbol": "AMZN",
        "shares": 0.4635806,
        "baseline_value_gbp": 80.08,
        "current_value_gbp": 79.36914279773525,
        "change_gbp": -0.7108572022647479,
        "change_pct": -0.887683819011923,
        "action": "HOLD",
        "action_reason": "",
        "risk_bucket": "core-ai",
        "analysis_summary": "AMZN (AMZN) is currently valued at £79.37 against a baseline of £80.08, giving a mark-to-market change of £-0.71 (-0.89%). It sits in the 'core-ai' risk bucket, which reflects how much volatility and drawdown we are prepared to tolerate for this position. The current rule-based action is **HOLD**, with the position remaining inside the normal tolerance band for now. From a macro perspective, the broader market backdrop is interpreted through indicators such as VIX, credit spreads and key index levels. Signals are mostly neutral with no strong positives or negatives. Sector-level signals capture whether the immediate ecosystem around AMZN is trending risk-on or risk-off relative to the wider market. Signals are mostly neutral with no strong positives or negatives. At the stock level, the engine folds together insider activity, options flows and other micro signals into a single risk-adjusted tilt. Signals are mostly neutral with no strong positives or negatives. Taken together, this keeps the emphasis on medium to high risk and high potential reward, while staying anchored to explicit rules rather than intuition. The summary should be read as a snapshot, updated each time a fresh evaluation is run rather than a standing recommendation. "
      }
    ],
    "totals": {
      "total_value_gbp": 444.48173483055973,
      "total_baseline_value": 441.81,
      "total_pnl_gbp": 2.6717348305597284,
      "total_pnl_pct": 0.6047248433851041,
      "available_funds": 0.0,
      "fx_rate": 0.7511799722799567
    }
  },
  "recommendations": {
    "buy": [],
    "sell": []
  },
  "risk_assessment": {
    "risk_score": 0,
    "risk_level": "Low",
    "signals": {
      "macro": {
        "vix_warning": false,
        "vix_critical": false,
        "credit_stress": false,
        "yield_spike": false
      },
      "sector": {
        "nvda_divergence": false,
        "semi_momentum_negative": false
      },
      "stock": {
        "AML.L": {
          "warning_insider_selling": false,
          "critical_insider_selling": false,
          "options_warning": false,
          "options_critical": false
        },
        "NVDA": {
          "warning_insider_selling": false,
          "critical_insider_selling": false,
          "options_warning": false,
          "options_critical": false
        },
        "ARM": {
          "warning_insider_selling": false,
          "critical_insider_selling": false,
          "options_warning": false,
          "options_critical": false
        },
        "AVGO": {
          "warning_insider_selling": false,
          "critical_insider_selling": false,
          "options_warning": false,
          "options_critical": false
        },
        "AMZN": {
          "warning_insider_selling": false,
          "critical_insider_selling": false,
          "options_warning": false,
          "options_critical": false
        }
      }
    }
  },
  "meta": {
    "version": "1.0",
    "environment": "production"
  }
}